/* **************************************************
*名称：数码管动态显示
*硬件连接：
* PE0~PE3 -> bit0~bit3
* PE5     -> 冒号分隔符
* PB0~PB7 -> a.b.c.d.e.f.g.dp (dp是小数点)
*描述：此代码可在数码管任意位显示"0~F"中的任意字符，
       同时增加了对于是否显示小数点和冒号分隔符的控制，
       并将小数点的控制参数放在了Display()函数的输入参数中，
       当然，也可以新建一个数组存储包含小数点的段选码，学会灵活使用即可。
******************************************************/
#include "iostm8s105c6.h"
#include "delay.h"

unsigned char  wei[] = {0xfe,0xfd,0xfb,0xf7};   //位选码
unsigned char duan[] = {0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,0x80,0x90,0xa0,0x83,0xc6,0xa1,0x86,0x8e}; //段选码，0-F的字形码（八段共阳数码管）

/*****************************
* 函数名： Display_IO_Init
* 描述：   数码管I/O引脚初始化
******************************/
void GPIO_Tube_Init(void)
{ 
    PE_DDR |= 0x0f;
    PE_CR1 |= 0x0f;
    PE_ODR |= 0x0f;		//位选选输出设置为低速推挽输出

    PB_DDR |= 0xff;
    PB_CR1 |= 0xff;    
    PB_ODR |= 0xff;		//段选输出设置为低速推挽输出，先关闭段选

	PE_DDR |= 0x20;
    PE_CR1 |= 0x20;
    PE_ODR |= 0x20;		//冒号两点的控制引脚设置为推挽输出
}

/*****************************
* 函数名：Display
* 描述：  数码管显示函数，依次扫描四位显示
* 输入参数：
			xbit:要显示的位数
			num:要显示的字符
******************************/
void Display(unsigned char xbit, unsigned char num)
{
	PE_ODR |= 0x0F;			//先关闭所有位选再重新选择
	PE_ODR &= wei[xbit];	//选择数码管位数
	PB_ODR  = duan[num];	//选择要显示的字符
	delay_ms(2);			//延时，每一位持续显示2ms
	PB_ODR = 0xff;			//关闭段选消除重影
}

/*****************************
* 函数名：show_colon
* 功能描述：显示冒号分隔符
******************************/
void Show_Colon(void)
{
	PE_ODR &= wei[1];	//选通第1位，显示的是冒号下面的点
	PE_ODR &= wei[2];	//选通第2位，显示的是冒号上面的点
	PE_ODR &= 0xDF;		//选通冒号的段选控制位(PE5)
	delay_ms(2);		//延时显示2ms
	PE_ODR |= ~(0xDF);	//关闭冒号的段选
}

